{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyOM9IDCRm/w2CUCfTcNwgO7"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["Instalamos libreria necesaria"],"metadata":{"id":"N7u_rvB4cfWb"}},{"cell_type":"code","source":["!pip install rdflib\n","github_storage = \"https://raw.githubusercontent.com/CesiProHD/SPARQL/main/output\""],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"KHQQXJMecqah","executionInfo":{"status":"ok","timestamp":1729012300886,"user_tz":-120,"elapsed":9004,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"46c6b83d-d6e2-4ff6-af2a-3b5250c5da82"},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting rdflib\n","  Downloading rdflib-7.0.0-py3-none-any.whl.metadata (11 kB)\n","Collecting isodate<0.7.0,>=0.6.0 (from rdflib)\n","  Downloading isodate-0.6.1-py2.py3-none-any.whl.metadata (9.6 kB)\n","Requirement already satisfied: pyparsing<4,>=2.1.0 in /usr/local/lib/python3.10/dist-packages (from rdflib) (3.1.4)\n","Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n","Downloading rdflib-7.0.0-py3-none-any.whl (531 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m531.9/531.9 kB\u001b[0m \u001b[31m12.5 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m41.7/41.7 kB\u001b[0m \u001b[31m1.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.1 rdflib-7.0.0\n"]}]},{"cell_type":"markdown","source":["Importamos las librerias necesarias e inicializamos el grafo"],"metadata":{"id":"7DelIbzact-p"}},{"cell_type":"code","source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","\n","g = Graph()\n","\n","EX = Namespace(\"http://abandoned.cars.com/\")\n","RML = Namespace(\"http://semweb.mmlab.be/ns/rml#\")\n","FOAF = Namespace(\"http://xmlns.com/foaf/0.1/\")\n","\n","g.namespace_manager.bind('ex', EX, override=False)\n","g.namespace_manager.bind('rml', RML, override=False)\n","g.namespace_manager.bind('foaf', FOAF, override=False)\n","g.namespace_manager.bind('rdf', RDF, override=False)\n","g.namespace_manager.bind('rdfs', RDFS, override=False)\n","\n","g.parse(github_storage, format=\"turtle\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"B-a1UTAJc0sS","executionInfo":{"status":"ok","timestamp":1729012313965,"user_tz":-120,"elapsed":2026,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"c3ee1c0e-a1f3-4559-ff2c-4d400ad89f73"},"execution_count":2,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N8acfd3ee9e9f4b95ae5b82f1dfa03cf7 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{},"execution_count":2}]},{"cell_type":"markdown","source":["INICIO CONSULTAS\n","---------------------------------------------------"],"metadata":{"id":"1J_k96kegegN"}},{"cell_type":"code","source":["ns = Namespace(\"http://abandoned.cars.com/\")"],"metadata":{"id":"fBLKWKVyBml2","executionInfo":{"status":"ok","timestamp":1729012316512,"user_tz":-120,"elapsed":582,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}}},"execution_count":3,"outputs":[]},{"cell_type":"markdown","source":["##Consulta 1\n","Consultar las clases del grafo"],"metadata":{"id":"816yfZdtgkEe"}},{"cell_type":"code","source":["query = \"\"\"\n","  SELECT DISTINCT ?class\n","  WHERE {\n","    ?s a ?class .\n","  }\n","  \"\"\"\n","\n","# Ejecutar la consulta\n","qres = g.query(query)\n","\n","# Imprimir los resultados\n","for row in qres:\n","    print(row)"],"metadata":{"id":"zH8HREaugr5M","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1729012318055,"user_tz":-120,"elapsed":3,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"8bcaabb0-468a-4ef6-9c83-fdc173793c8e"},"execution_count":4,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://abandoned.cars.com/Data'),)\n","(rdflib.term.URIRef('http://abandoned.cars.com/District'),)\n"]}]},{"cell_type":"markdown","source":["##Consulta 2\n","Consultar las propiedades del grafo"],"metadata":{"id":"EuEYPzhlCUDU"}},{"cell_type":"code","source":["query = \"\"\"\n","  SELECT DISTINCT ?property\n","  WHERE {\n","    ?s ?property ?o .\n","  }\n","  \"\"\"\n","# Ejecutar la consulta\n","qres = g.query(query)\n","\n","# Imprimir los resultados\n","for row in qres:\n","    print(row)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"gDBsvqcsBsI5","executionInfo":{"status":"ok","timestamp":1729012320937,"user_tz":-120,"elapsed":900,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"b8458b84-1742-410a-bc98-3cb8288b811e"},"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('http://abandoned.cars.com/hasYear'),)\n","(rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'),)\n","(rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'),)\n","(rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'),)\n","(rdflib.term.URIRef('http://abandoned.cars.com/hasRegion'),)\n","(rdflib.term.URIRef('http://abandoned.cars.com/hasONSCode'),)\n"]}]},{"cell_type":"markdown","source":["##Consulta 3\n","Consultar las tripletas que tiene el grafo, lo limitamos a 100 para que no muestre todos los datos."],"metadata":{"id":"ggrfxvgxEeku"}},{"cell_type":"code","source":["query = \"\"\"\n","  SELECT ?s ?p ?o\n","  WHERE {\n","    ?s ?p ?o .\n","  } LIMIT 100\n","  \"\"\"\n","\n","# Ejecutar la consulta\n","qres = g.query(query)\n","\n","# Imprimir los resultados\n","for row in qres:\n","    print(row)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"MiiwefwXEnfq","executionInfo":{"status":"ok","timestamp":1729012332821,"user_tz":-120,"elapsed":355,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"feaff99a-5df0-4055-a333-e84cad731161"},"execution_count":6,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('https://abandoned.cars.com/Waveney_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2001'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Tameside_2007_08'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/North%20Warwickshire_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2001'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/South%20Kesteven_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/South%20Kesteven'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Berwick-upon-Tweed_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('53'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Boston_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('259'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Warwick_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('137'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/East%20Cambridgeshire'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/District'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Hackney_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('1540'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Nuneaton%20and%20Bedworth_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2003'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Havant_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2003'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Fareham_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('136'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/South%20Shropshire'), rdflib.term.URIRef('http://abandoned.cars.com/hasRegion'), rdflib.term.Literal('W Midlands'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Enfield_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Enfield'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Mid%20Suffolk_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2001'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Newcastle-under-Lyme_2000_01'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Berwick-upon-Tweed_2005_06'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Fenland_2004_05'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2004'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Amber%20Valley_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('27'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Pendle_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('392'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Calderdale%20UA_2005_06'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/West%20Wiltshire_2007_08'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2007'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Blaby_2000_01'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Babergh'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/District'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Mid%20Suffolk_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2005'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Mid%20Suffolk_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2003'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/East%20Hertfordshire_2002_03'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Rother_2003_04'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Worcester_2007_08'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Worcester'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Christchurch_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Christchurch'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Sutton_2004_05'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Sutton'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/St.%20Edmundsbury_2001_02'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/West%20Wiltshire_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/West%20Wiltshire'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/King%27s%20Lynn%20and%20West%20Norfolk_2007_08'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Richmondshire_2007_08'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2007'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Telford%20and%20Wrekin%20UA_2002_03'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Caradon_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Caradon'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Hyndburn_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2005'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Runnymede'), rdflib.term.URIRef('http://abandoned.cars.com/hasRegion'), rdflib.term.Literal('S East'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Ryedale_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2003'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/North%20Warwickshire_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2002'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Isle%20of%20Wight%20UA_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2002'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Stevenage_2002_03'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Havant_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('262'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Hammersmith%20and%20Fulham_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Hammersmith%20and%20Fulham'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Harrogate_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('355'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Uttlesford_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2003'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Chesterfield_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Chesterfield'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Teesdale_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Teesdale'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/North%20Lincolnshire%20UA_2005_06'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Southend-on-Sea%20UA_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('1745'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Taunton%20Deane_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Taunton%20Deane'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Fenland_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Fenland'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Reading%20UA'), rdflib.term.URIRef('http://abandoned.cars.com/hasONSCode'), rdflib.term.Literal('00MC'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Sevenoaks_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Sevenoaks'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Middlesbrough%20UA_2001_02'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Boston_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2006'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Torridge_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2000'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Spelthorne_2000_01'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Huntingdonshire_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Huntingdonshire'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/North%20Dorset_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('111'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Blaby_2004_05'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2004'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Mendip_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Mendip'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Wansbeck'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/District'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Three%20Rivers_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Three%20Rivers'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Worthing_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2000'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Rossendale_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Rossendale'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Sedgemoor_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2000'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Harborough_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Harborough'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Bromsgrove_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Bromsgrove'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/North%20Tyneside%20UA_2007_08'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('155.0'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/South%20Norfolk_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('116'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Watford_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('878'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Colchester_2002_03'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2002'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Tewkesbury_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Tewkesbury'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Southend-on-Sea%20UA'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/District'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Blaby_2007_08'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Blaby'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Durham%20City_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2006'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Derbyshire%20Dales_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2003'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Cambridge_2007_08'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Harlow_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Harlow'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Sefton_2007_08'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('19.0'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Peterborough%20UA_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2005'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Oldham_2003_04'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Oldham'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Trafford_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2006'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Lambeth'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/District'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Brent_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Brent'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Stratford-on-Avon_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Stratford-on-Avon'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Bromsgrove_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('239'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Reading%20UA_2005_06'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Reading%20UA'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Christchurch_2002_03'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Pendle_2006_07'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('39'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Three%20Rivers_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Three%20Rivers'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Taunton%20Deane_2001_02'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Copeland_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasAmount'), rdflib.term.Literal('118'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Eastleigh_2000_01'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2000'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Hastings_2007_08'), rdflib.term.URIRef('http://abandoned.cars.com/hasYear'), rdflib.term.Literal('2007'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Doncaster%20UA_2004_05'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://abandoned.cars.com/Data'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Blackburn%20with%20Darwen%20UA_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Blackburn%20with%20Darwen%20UA'))\n","(rdflib.term.URIRef('https://abandoned.cars.com/Stockport_2001_02'), rdflib.term.URIRef('http://abandoned.cars.com/hasDistrict'), rdflib.term.URIRef('https://abandoned.cars.com/districts/Stockport'))\n"]}]},{"cell_type":"markdown","source":["##Consulta 4\n","Consultar los distritos cuya region es \"S East\""],"metadata":{"id":"rI7jW4TPFI-l"}},{"cell_type":"code","source":["#Cambiar la URI, falta un / entre \"com\" y \"hasRegion\"\n","\n","query = \"\"\"\n","  SELECT ?DISTRICT\n","  WHERE {\n","    ?DISTRICT ex:hasRegion \"Eastern\" .\n","  }\n","  \"\"\"\n","\n","# Ejecutar la consulta\n","qres = g.query(query)\n","\n","# Imprimir los resultados\n","for row in qres:\n","    print(row)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"YQVFI17kFQX9","executionInfo":{"status":"ok","timestamp":1729012341021,"user_tz":-120,"elapsed":3,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"451e0244-718a-4737-b49a-c34beeede9b5"},"execution_count":7,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.URIRef('https://abandoned.cars.com/districts/Babergh'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Basildon'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Bedford'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Braintree'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Breckland'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Brentwood'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Broadland'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Broxbourne'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Cambridge'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Castle%20Point'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Chelmsford'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Colchester'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Dacorum'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/East%20Cambridgeshire'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/East%20Hertfordshire'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Epping%20Forest'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Fenland'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Forest%20Heath'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Great%20Yarmouth'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Harlow'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Hertsmere'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Huntingdonshire'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Ipswich'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/King%27s%20Lynn%20and%20West%20Norfolk'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Luton%20UA'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Maldon'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Mid%20Bedfordshire'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Mid%20Suffolk'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/North%20Hertfordshire'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/North%20Norfolk'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Norwich'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Peterborough%20UA'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Rochford'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/South%20Bedfordshire'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/South%20Cambridgeshire'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/South%20Norfolk'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Southend-on-Sea%20UA'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/St.%20Albans'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/St.%20Edmundsbury'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Stevenage'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Suffolk%20Coastal'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Tendring'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Three%20Rivers'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Thurrock%20UA'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Uttlesford'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Watford'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Waveney'),)\n","(rdflib.term.URIRef('https://abandoned.cars.com/districts/Welwyn%20Hatfield'),)\n"]}]},{"cell_type":"markdown","source":["##Consulta 5\n","Mostrar la cantidad total de coches abandonados en el año 2003, para la region S East."],"metadata":{"id":"8pnJQxHmHnJM"}},{"cell_type":"code","source":["query = \"\"\"\n","  SELECT (SUM(xsd:integer(?amount)) AS ?totalAbandonedCars)\n","  WHERE {\n","      ?district ex:hasRegion \"S East\" .\n","      ?data ex:hasYear \"2003\" .\n","      ?data ex:hasAmount ?amount .\n","      ?data ex:hasDistrict ?district .\n","  }\n","\"\"\"\n","\n","# Ejecutar la consulta\n","qres = g.query(query)\n","\n","# Imprimir los resultados\n","for row in qres:\n","    print(row)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"GO-hAtSAHvzN","executionInfo":{"status":"ok","timestamp":1729012916558,"user_tz":-120,"elapsed":725,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"d52c9bf6-ebe7-4b58-d532-aad6bcffbd31"},"execution_count":14,"outputs":[{"output_type":"stream","name":"stdout","text":["(rdflib.term.Literal('36489', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n"]}]},{"cell_type":"markdown","source":["##Consulta 6\n","Consultar los distritos con mayor numero de coches abandonados en el año 2004"],"metadata":{"id":"YeUxuQgrXlCp"}},{"cell_type":"code","source":["query = \"\"\"\n","SELECT ?district (SUM(xsd:integer(?amount)) AS ?totalAbandonedCars)\n","WHERE {\n","    ?data ex:hasYear \"2004\" .\n","    ?data ex:hasDistrict ?district .\n","    ?data ex:hasAmount ?amount .\n","}\n","GROUP BY ?district\n","ORDER BY DESC(?totalAbandonedCars)\n","\"\"\"\n","\n","# Ejecutar la consulta\n","qres = g.query(query)\n","\n","# Imprimir los resultados\n","for row in qres:\n","    print(f\"District: {row.district}, Total Abandoned Cars: {row.totalAbandonedCars}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"sRAQZvYkX9Fj","executionInfo":{"status":"ok","timestamp":1729013093103,"user_tz":-120,"elapsed":598,"user":{"displayName":"Cesar Ruiz Deiros","userId":"00275256203270030075"}},"outputId":"4fdd341e-edf1-4269-e959-166777f730b5"},"execution_count":18,"outputs":[{"output_type":"stream","name":"stdout","text":["District: https://abandoned.cars.com/districts/Medway%20UA, Total Abandoned Cars: 3154\n","District: https://abandoned.cars.com/districts/Merton, Total Abandoned Cars: 3036\n","District: https://abandoned.cars.com/districts/Barnet, Total Abandoned Cars: 2593\n","District: https://abandoned.cars.com/districts/Nottingham%20UA, Total Abandoned Cars: 2502\n","District: https://abandoned.cars.com/districts/Enfield, Total Abandoned Cars: 2368\n","District: https://abandoned.cars.com/districts/Doncaster%20UA, Total Abandoned Cars: 2275\n","District: https://abandoned.cars.com/districts/Birmingham%20UA, Total Abandoned Cars: 2273\n","District: https://abandoned.cars.com/districts/Luton%20UA, Total Abandoned Cars: 2097\n","District: https://abandoned.cars.com/districts/Wandsworth, Total Abandoned Cars: 2096\n","District: https://abandoned.cars.com/districts/Oxford, Total Abandoned Cars: 2083\n","District: https://abandoned.cars.com/districts/Greenwich, Total Abandoned Cars: 1879\n","District: https://abandoned.cars.com/districts/Haringey, Total Abandoned Cars: 1594\n","District: https://abandoned.cars.com/districts/City%20of%20Kingston-upon-Hull%20UA, Total Abandoned Cars: 1575\n","District: https://abandoned.cars.com/districts/Ipswich, Total Abandoned Cars: 1510\n","District: https://abandoned.cars.com/districts/Tameside, Total Abandoned Cars: 1509\n","District: https://abandoned.cars.com/districts/Gloucester, Total Abandoned Cars: 1467\n","District: https://abandoned.cars.com/districts/Southampton%20UA, Total Abandoned Cars: 1465\n","District: https://abandoned.cars.com/districts/Hounslow, Total Abandoned Cars: 1448\n","District: https://abandoned.cars.com/districts/Waltham%20Forest, Total Abandoned Cars: 1333\n","District: https://abandoned.cars.com/districts/Tower%20Hamlets, Total Abandoned Cars: 1322\n","District: https://abandoned.cars.com/districts/Hammersmith%20and%20Fulham, Total Abandoned Cars: 1296\n","District: https://abandoned.cars.com/districts/Thurrock%20UA, Total Abandoned Cars: 1272\n","District: https://abandoned.cars.com/districts/Peterborough%20UA, Total Abandoned Cars: 1194\n","District: https://abandoned.cars.com/districts/Camden, Total Abandoned Cars: 1069\n","District: https://abandoned.cars.com/districts/Solihull%20UA, Total Abandoned Cars: 1047\n","District: https://abandoned.cars.com/districts/Southend-on-Sea%20UA, Total Abandoned Cars: 1036\n","District: https://abandoned.cars.com/districts/Bradford%20UA, Total Abandoned Cars: 1025\n","District: https://abandoned.cars.com/districts/Brent, Total Abandoned Cars: 1014\n","District: https://abandoned.cars.com/districts/Leicester%20UA, Total Abandoned Cars: 967\n","District: https://abandoned.cars.com/districts/Wirral, Total Abandoned Cars: 961\n","District: https://abandoned.cars.com/districts/Barking%20and%20Dagenham, Total Abandoned Cars: 940\n","District: https://abandoned.cars.com/districts/Islington, Total Abandoned Cars: 927\n","District: https://abandoned.cars.com/districts/Liverpool, Total Abandoned Cars: 902\n","District: https://abandoned.cars.com/districts/Bexley, Total Abandoned Cars: 781\n","District: https://abandoned.cars.com/districts/North%20Kesteven, Total Abandoned Cars: 778\n","District: https://abandoned.cars.com/districts/City%20of%20Bristol%20UA, Total Abandoned Cars: 772\n","District: https://abandoned.cars.com/districts/Mole%20Valley, Total Abandoned Cars: 715\n","District: https://abandoned.cars.com/districts/South%20Gloucestershire%20UA, Total Abandoned Cars: 706\n","District: https://abandoned.cars.com/districts/Kirklees%20UA, Total Abandoned Cars: 674\n","District: https://abandoned.cars.com/districts/Spelthorne, Total Abandoned Cars: 673\n","District: https://abandoned.cars.com/districts/Portsmouth%20UA, Total Abandoned Cars: 659\n","District: https://abandoned.cars.com/districts/Bedford, Total Abandoned Cars: 654\n","District: https://abandoned.cars.com/districts/Derby%20UA, Total Abandoned Cars: 635\n","District: https://abandoned.cars.com/districts/North%20Hertfordshire, Total Abandoned Cars: 612\n","District: https://abandoned.cars.com/districts/Bromley, Total Abandoned Cars: 581\n","District: https://abandoned.cars.com/districts/North%20East%20Lincolnshire%20UA, Total Abandoned Cars: 580\n","District: https://abandoned.cars.com/districts/Basildon, Total Abandoned Cars: 573\n","District: https://abandoned.cars.com/districts/Great%20Yarmouth, Total Abandoned Cars: 568\n","District: https://abandoned.cars.com/districts/Sheffield%20UA, Total Abandoned Cars: 547\n","District: https://abandoned.cars.com/districts/St.%20Edmundsbury, Total Abandoned Cars: 522\n","District: https://abandoned.cars.com/districts/Dacorum, Total Abandoned Cars: 514\n","District: https://abandoned.cars.com/districts/Rossendale, Total Abandoned Cars: 506\n","District: https://abandoned.cars.com/districts/Bath%20and%20NE%20Somerset%20UA, Total Abandoned Cars: 501\n","District: https://abandoned.cars.com/districts/Richmond%20upon%20Thames, Total Abandoned Cars: 494\n","District: https://abandoned.cars.com/districts/Blackburn%20with%20Darwen%20UA, Total Abandoned Cars: 493\n","District: https://abandoned.cars.com/districts/Lambeth, Total Abandoned Cars: 484\n","District: https://abandoned.cars.com/districts/Swindon%20UA, Total Abandoned Cars: 481\n","District: https://abandoned.cars.com/districts/Coventry%20UA, Total Abandoned Cars: 474\n","District: https://abandoned.cars.com/districts/Harlow, Total Abandoned Cars: 474\n","District: https://abandoned.cars.com/districts/Sutton, Total Abandoned Cars: 474\n","District: https://abandoned.cars.com/districts/Wolverhampton%20UA, Total Abandoned Cars: 456\n","District: https://abandoned.cars.com/districts/Thanet, Total Abandoned Cars: 452\n","District: https://abandoned.cars.com/districts/Arun, Total Abandoned Cars: 439\n","District: https://abandoned.cars.com/districts/Gravesham, Total Abandoned Cars: 390\n","District: https://abandoned.cars.com/districts/Torbay%20UA, Total Abandoned Cars: 383\n","District: https://abandoned.cars.com/districts/East%20Riding%20of%20Yorkshire%20UA, Total Abandoned Cars: 370\n","District: https://abandoned.cars.com/districts/Tewkesbury, Total Abandoned Cars: 360\n","District: https://abandoned.cars.com/districts/Babergh, Total Abandoned Cars: 349\n","District: https://abandoned.cars.com/districts/Basingstoke%20and%20Deane, Total Abandoned Cars: 345\n","District: https://abandoned.cars.com/districts/Penwith, Total Abandoned Cars: 342\n","District: https://abandoned.cars.com/districts/Stockton-on-Tees%20UA, Total Abandoned Cars: 328\n","District: https://abandoned.cars.com/districts/Stockport, Total Abandoned Cars: 322\n","District: https://abandoned.cars.com/districts/North%20Tyneside%20UA, Total Abandoned Cars: 319\n","District: https://abandoned.cars.com/districts/Suffolk%20Coastal, Total Abandoned Cars: 318\n","District: https://abandoned.cars.com/districts/Rotherham%20UA, Total Abandoned Cars: 315\n","District: https://abandoned.cars.com/districts/Bolton, Total Abandoned Cars: 312\n","District: https://abandoned.cars.com/districts/Hillingdon, Total Abandoned Cars: 310\n","District: https://abandoned.cars.com/districts/Calderdale%20UA, Total Abandoned Cars: 308\n","District: https://abandoned.cars.com/districts/North%20Somerset%20UA, Total Abandoned Cars: 308\n","District: https://abandoned.cars.com/districts/Canterbury, Total Abandoned Cars: 305\n","District: https://abandoned.cars.com/districts/West%20Dorset, Total Abandoned Cars: 303\n","District: https://abandoned.cars.com/districts/County%20of%20Herefordshire%20UA, Total Abandoned Cars: 301\n","District: https://abandoned.cars.com/districts/Eastbourne, Total Abandoned Cars: 301\n","District: https://abandoned.cars.com/districts/Reading%20UA, Total Abandoned Cars: 299\n","District: https://abandoned.cars.com/districts/Darlington%20UA, Total Abandoned Cars: 297\n","District: https://abandoned.cars.com/districts/Hartlepool%20UA, Total Abandoned Cars: 293\n","District: https://abandoned.cars.com/districts/Chester, Total Abandoned Cars: 292\n","District: https://abandoned.cars.com/districts/Ashfield, Total Abandoned Cars: 291\n","District: https://abandoned.cars.com/districts/Worthing, Total Abandoned Cars: 287\n","District: https://abandoned.cars.com/districts/East%20Hertfordshire, Total Abandoned Cars: 286\n","District: https://abandoned.cars.com/districts/Wealden, Total Abandoned Cars: 282\n","District: https://abandoned.cars.com/districts/Kerrier, Total Abandoned Cars: 281\n","District: https://abandoned.cars.com/districts/Adur, Total Abandoned Cars: 279\n","District: https://abandoned.cars.com/districts/Guildford, Total Abandoned Cars: 279\n","District: https://abandoned.cars.com/districts/Rochdale, Total Abandoned Cars: 277\n","District: https://abandoned.cars.com/districts/Welwyn%20Hatfield, Total Abandoned Cars: 277\n","District: https://abandoned.cars.com/districts/Braintree, Total Abandoned Cars: 276\n","District: https://abandoned.cars.com/districts/Teignbridge, Total Abandoned Cars: 272\n","District: https://abandoned.cars.com/districts/Reigate%20and%20Banstead, Total Abandoned Cars: 269\n","District: https://abandoned.cars.com/districts/Test%20Valley, Total Abandoned Cars: 264\n","District: https://abandoned.cars.com/districts/Wakefield%20UA, Total Abandoned Cars: 262\n","District: https://abandoned.cars.com/districts/Restormel, Total Abandoned Cars: 261\n","District: https://abandoned.cars.com/districts/Middlesbrough%20UA, Total Abandoned Cars: 260\n","District: https://abandoned.cars.com/districts/Swale, Total Abandoned Cars: 260\n","District: https://abandoned.cars.com/districts/Chichester, Total Abandoned Cars: 256\n","District: https://abandoned.cars.com/districts/Vale%20Royal, Total Abandoned Cars: 253\n","District: https://abandoned.cars.com/districts/Epsom%20and%20Ewell, Total Abandoned Cars: 251\n","District: https://abandoned.cars.com/districts/South%20Oxfordshire, Total Abandoned Cars: 251\n","District: https://abandoned.cars.com/districts/Carlisle, Total Abandoned Cars: 245\n","District: https://abandoned.cars.com/districts/Sedgemoor, Total Abandoned Cars: 244\n","District: https://abandoned.cars.com/districts/South%20Holland, Total Abandoned Cars: 243\n","District: https://abandoned.cars.com/districts/Watford, Total Abandoned Cars: 238\n","District: https://abandoned.cars.com/districts/Boston, Total Abandoned Cars: 232\n","District: https://abandoned.cars.com/districts/St.%20Albans, Total Abandoned Cars: 227\n","District: https://abandoned.cars.com/districts/Tamworth, Total Abandoned Cars: 227\n","District: https://abandoned.cars.com/districts/Isle%20of%20Wight%20UA, Total Abandoned Cars: 225\n","District: https://abandoned.cars.com/districts/Telford%20and%20Wrekin%20UA, Total Abandoned Cars: 223\n","District: https://abandoned.cars.com/districts/Waveney, Total Abandoned Cars: 218\n","District: https://abandoned.cars.com/districts/Wellingborough, Total Abandoned Cars: 217\n","District: https://abandoned.cars.com/districts/Vale%20of%20White%20Horse, Total Abandoned Cars: 216\n","District: https://abandoned.cars.com/districts/Ashford, Total Abandoned Cars: 214\n","District: https://abandoned.cars.com/districts/Gosport, Total Abandoned Cars: 214\n","District: https://abandoned.cars.com/districts/New%20Forest, Total Abandoned Cars: 212\n","District: https://abandoned.cars.com/districts/South%20Cambridgeshire, Total Abandoned Cars: 212\n","District: https://abandoned.cars.com/districts/Tandridge, Total Abandoned Cars: 210\n","District: https://abandoned.cars.com/districts/Westminster, Total Abandoned Cars: 210\n","District: https://abandoned.cars.com/districts/Aylesbury%20Vale, Total Abandoned Cars: 206\n","District: https://abandoned.cars.com/districts/Poole%20UA, Total Abandoned Cars: 204\n","District: https://abandoned.cars.com/districts/Chester-le-Street, Total Abandoned Cars: 202\n","District: https://abandoned.cars.com/districts/Sunderland%20UA, Total Abandoned Cars: 201\n","District: https://abandoned.cars.com/districts/Lewes, Total Abandoned Cars: 197\n","District: https://abandoned.cars.com/districts/Rushcliffe, Total Abandoned Cars: 197\n","District: https://abandoned.cars.com/districts/Blackpool%20UA, Total Abandoned Cars: 196\n","District: https://abandoned.cars.com/districts/Gedling, Total Abandoned Cars: 194\n","District: https://abandoned.cars.com/districts/Nuneaton%20and%20Bedworth, Total Abandoned Cars: 192\n","District: https://abandoned.cars.com/districts/Windsor%20and%20Maidenhead%20UA, Total Abandoned Cars: 190\n","District: https://abandoned.cars.com/districts/Sedgefield, Total Abandoned Cars: 186\n","District: https://abandoned.cars.com/districts/West%20Oxfordshire, Total Abandoned Cars: 185\n","District: https://abandoned.cars.com/districts/Maidstone, Total Abandoned Cars: 184\n","District: https://abandoned.cars.com/districts/Manchester, Total Abandoned Cars: 182\n","District: https://abandoned.cars.com/districts/East%20Staffordshire, Total Abandoned Cars: 181\n","District: https://abandoned.cars.com/districts/Shepway, Total Abandoned Cars: 179\n","District: https://abandoned.cars.com/districts/Broxtowe, Total Abandoned Cars: 177\n","District: https://abandoned.cars.com/districts/Carrick, Total Abandoned Cars: 174\n","District: https://abandoned.cars.com/districts/Havant, Total Abandoned Cars: 174\n","District: https://abandoned.cars.com/districts/Horsham, Total Abandoned Cars: 173\n","District: https://abandoned.cars.com/districts/Dover, Total Abandoned Cars: 171\n","District: https://abandoned.cars.com/districts/Tunbridge%20Wells, Total Abandoned Cars: 168\n","District: https://abandoned.cars.com/districts/Mid%20Sussex, Total Abandoned Cars: 164\n","District: https://abandoned.cars.com/districts/Sevenoaks, Total Abandoned Cars: 163\n","District: https://abandoned.cars.com/districts/Bracknell%20Forest%20UA, Total Abandoned Cars: 162\n","District: https://abandoned.cars.com/districts/East%20Northamptonshire, Total Abandoned Cars: 158\n","District: https://abandoned.cars.com/districts/South%20Buckinghamshire, Total Abandoned Cars: 158\n","District: https://abandoned.cars.com/districts/Bassetlaw, Total Abandoned Cars: 153\n","District: https://abandoned.cars.com/districts/Bromsgrove, Total Abandoned Cars: 151\n","District: https://abandoned.cars.com/districts/Forest%20of%20Dean, Total Abandoned Cars: 150\n","District: https://abandoned.cars.com/districts/North%20Lincolnshire%20UA, Total Abandoned Cars: 149\n","District: https://abandoned.cars.com/districts/Rugby, Total Abandoned Cars: 149\n","District: https://abandoned.cars.com/districts/West%20Lancashire, Total Abandoned Cars: 149\n","District: https://abandoned.cars.com/districts/Runnymede, Total Abandoned Cars: 144\n","District: https://abandoned.cars.com/districts/Fenland, Total Abandoned Cars: 142\n","District: https://abandoned.cars.com/districts/Kensington%20and%20Chelsea, Total Abandoned Cars: 138\n","District: https://abandoned.cars.com/districts/Castle%20Point, Total Abandoned Cars: 136\n","District: https://abandoned.cars.com/districts/South%20Hams, Total Abandoned Cars: 136\n","District: https://abandoned.cars.com/districts/Taunton%20Deane, Total Abandoned Cars: 136\n","District: https://abandoned.cars.com/districts/Tonbridge%20and%20Malling, Total Abandoned Cars: 133\n","District: https://abandoned.cars.com/districts/Blyth%20Valley, Total Abandoned Cars: 129\n","District: https://abandoned.cars.com/districts/Mid%20Suffolk, Total Abandoned Cars: 127\n","District: https://abandoned.cars.com/districts/South%20Ribble, Total Abandoned Cars: 127\n","District: https://abandoned.cars.com/districts/Harrogate, Total Abandoned Cars: 126\n","District: https://abandoned.cars.com/districts/Bury, Total Abandoned Cars: 125\n","District: https://abandoned.cars.com/districts/East%20Hampshire, Total Abandoned Cars: 123\n","District: https://abandoned.cars.com/districts/Wansbeck, Total Abandoned Cars: 122\n","District: https://abandoned.cars.com/districts/Weymouth%20and%20Portland, Total Abandoned Cars: 122\n","District: https://abandoned.cars.com/districts/Dartford, Total Abandoned Cars: 121\n","District: https://abandoned.cars.com/districts/Hertsmere, Total Abandoned Cars: 121\n","District: https://abandoned.cars.com/districts/Melton, Total Abandoned Cars: 121\n","District: https://abandoned.cars.com/districts/Hart, Total Abandoned Cars: 120\n","District: https://abandoned.cars.com/districts/Winchester, Total Abandoned Cars: 120\n","District: https://abandoned.cars.com/districts/Rushmoor, Total Abandoned Cars: 119\n","District: https://abandoned.cars.com/districts/Salisbury, Total Abandoned Cars: 114\n","District: https://abandoned.cars.com/districts/Chiltern, Total Abandoned Cars: 110\n","District: https://abandoned.cars.com/districts/Woking, Total Abandoned Cars: 103\n","District: https://abandoned.cars.com/districts/Mid%20Bedfordshire, Total Abandoned Cars: 102\n","District: https://abandoned.cars.com/districts/Surrey%20Heath, Total Abandoned Cars: 102\n","District: https://abandoned.cars.com/districts/Newark%20and%20Sherwood, Total Abandoned Cars: 101\n","District: https://abandoned.cars.com/districts/City%20of%20London, Total Abandoned Cars: 100\n","District: https://abandoned.cars.com/districts/North%20Dorset, Total Abandoned Cars: 100\n","District: https://abandoned.cars.com/districts/South%20Lakeland, Total Abandoned Cars: 96\n","District: https://abandoned.cars.com/districts/Derwentside, Total Abandoned Cars: 90\n","District: https://abandoned.cars.com/districts/Pendle, Total Abandoned Cars: 88\n","District: https://abandoned.cars.com/districts/Oadby%20and%20Wigston, Total Abandoned Cars: 87\n","District: https://abandoned.cars.com/districts/Blaby, Total Abandoned Cars: 85\n","District: https://abandoned.cars.com/districts/Hyndburn, Total Abandoned Cars: 85\n","District: https://abandoned.cars.com/districts/Lincoln, Total Abandoned Cars: 84\n","District: https://abandoned.cars.com/districts/Gateshead%20UA, Total Abandoned Cars: 83\n","District: https://abandoned.cars.com/districts/Macclesfield, Total Abandoned Cars: 83\n","District: https://abandoned.cars.com/districts/Shrewsbury%20and%20Atcham, Total Abandoned Cars: 79\n","District: https://abandoned.cars.com/districts/Allerdale, Total Abandoned Cars: 78\n","District: https://abandoned.cars.com/districts/East%20Dorset, Total Abandoned Cars: 75\n","District: https://abandoned.cars.com/districts/Kennet, Total Abandoned Cars: 73\n","District: https://abandoned.cars.com/districts/Torridge, Total Abandoned Cars: 72\n","District: https://abandoned.cars.com/districts/Cotswold, Total Abandoned Cars: 69\n","District: https://abandoned.cars.com/districts/South%20Norfolk, Total Abandoned Cars: 66\n","District: https://abandoned.cars.com/districts/Hinckley%20and%20Bosworth, Total Abandoned Cars: 65\n","District: https://abandoned.cars.com/districts/Barrow-in-Furness, Total Abandoned Cars: 63\n","District: https://abandoned.cars.com/districts/Wyre%20Forest, Total Abandoned Cars: 61\n","District: https://abandoned.cars.com/districts/High%20Peak, Total Abandoned Cars: 60\n","District: https://abandoned.cars.com/districts/Copeland, Total Abandoned Cars: 57\n","District: https://abandoned.cars.com/districts/North%20West%20Leicestershire, Total Abandoned Cars: 57\n","District: https://abandoned.cars.com/districts/North%20East%20Derbyshire, Total Abandoned Cars: 52\n","District: https://abandoned.cars.com/districts/Lichfield, Total Abandoned Cars: 50\n","District: https://abandoned.cars.com/districts/North%20Wiltshire, Total Abandoned Cars: 50\n","District: https://abandoned.cars.com/districts/Chesterfield, Total Abandoned Cars: 49\n","District: https://abandoned.cars.com/districts/South%20Staffordshire, Total Abandoned Cars: 48\n","District: https://abandoned.cars.com/districts/Tynedale, Total Abandoned Cars: 46\n","District: https://abandoned.cars.com/districts/Wyre, Total Abandoned Cars: 46\n","District: https://abandoned.cars.com/districts/Selby, Total Abandoned Cars: 45\n","District: https://abandoned.cars.com/districts/Castle%20Morpeth, Total Abandoned Cars: 43\n","District: https://abandoned.cars.com/districts/Sefton, Total Abandoned Cars: 42\n","District: https://abandoned.cars.com/districts/Malvern%20Hills, Total Abandoned Cars: 35\n","District: https://abandoned.cars.com/districts/Oswestry, Total Abandoned Cars: 34\n","District: https://abandoned.cars.com/districts/Purbeck, Total Abandoned Cars: 34\n","District: https://abandoned.cars.com/districts/South%20Derbyshire, Total Abandoned Cars: 31\n","District: https://abandoned.cars.com/districts/Craven, Total Abandoned Cars: 29\n","District: https://abandoned.cars.com/districts/Rutland%20UA, Total Abandoned Cars: 28\n","District: https://abandoned.cars.com/districts/Berwick-upon-Tweed, Total Abandoned Cars: 27\n","District: https://abandoned.cars.com/districts/Eden, Total Abandoned Cars: 27\n","District: https://abandoned.cars.com/districts/Staffordshire%20Moorlands, Total Abandoned Cars: 27\n","District: https://abandoned.cars.com/districts/Derbyshire%20Dales, Total Abandoned Cars: 25\n","District: https://abandoned.cars.com/districts/Hambleton, Total Abandoned Cars: 25\n","District: https://abandoned.cars.com/districts/Alnwick, Total Abandoned Cars: 23\n","District: https://abandoned.cars.com/districts/Bridgnorth, Total Abandoned Cars: 23\n","District: https://abandoned.cars.com/districts/West%20Somerset, Total Abandoned Cars: 23\n","District: https://abandoned.cars.com/districts/Christchurch, Total Abandoned Cars: 20\n","District: https://abandoned.cars.com/districts/Ribble%20Valley, Total Abandoned Cars: 20\n","District: https://abandoned.cars.com/districts/South%20Shropshire, Total Abandoned Cars: 20\n","District: https://abandoned.cars.com/districts/Teesdale, Total Abandoned Cars: 12\n","District: https://abandoned.cars.com/districts/Ryedale, Total Abandoned Cars: 10\n","District: https://abandoned.cars.com/districts/Isles%20of%20Scilly, Total Abandoned Cars: 0\n"]}]}]}